RIET/src/DataProcessors/PullReportsFromServiceProvidersEmails/PullReportsFromServiceProvidersEmails.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>PullReportsFromServiceProvidersEmails</name>
  <tabularSections>
    <name>Unprocessed</name>
    <attributes>
      <name>UID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SentDate</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>From</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Subject</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Body</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Attachment</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

RIET/src/InformationRegisters/UIDsOfProcessedEmails/UIDsOfProcessedEmails.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>UIDsOfProcessedEmails</name>
  <dimensions>
    <name>Account</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>UID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/DataProcessors/PullReportsFromServiceProvidersEmails/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	     	
	Для каждого СтрокаТЧ Из Объект.Unprocessed Цикл
		Попытка
			УдалитьФайлы(СтрокаТЧ.Attachment);
		Исключение
		КонецПопытки;
 	КонецЦикла;	
	      			
КонецПроцедуры

&НаКлиенте
Процедура UnprocessedВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Попытка
	 	ЗапуститьПриложение(Элементы.Unprocessed.ТекущиеДанные.Attachment);
	Исключение
	КонецПопытки;
	
КонецПроцедуры
            
//////////////////////////////////////////////////////////////////////////////////////
// RECEIVE EMAILS

&НаКлиенте
Процедура ReceiveEmails(Команда)
		
	ReceiveEmailsНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ReceiveEmailsНаСервере()
		
	УстановитьПривилегированныйРежим(Истина);
	// { RGS EParshina 27.09.2018 18:47:10 - S-I-0006076
	//ИнтернетПочтовыйПрофиль = ImportExportСерверПовтИспСеанс.ПолучитьИнтернетПочтовыйПрофиль();
	//ИнтернетПочта = ImportExportСервер.ПодключитьсяКИнтернетПочте(ИнтернетПочтовыйПрофиль);
	УчетнаяЗапись = Константы.RIETEmailAccount.Получить();
	ИнтернетПочтовыйПрофиль = РаботаСПочтовымиСообщениямиСлужебный.ИнтернетПочтовыйПрофиль(УчетнаяЗапись, Истина);
	
	ИнтернетПочта = Новый ИнтернетПочта;
	Протокол = ПротоколИнтернетПочты.POP3;
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись, "ПротоколВходящейПочты") = "IMAP" Тогда
		Протокол = ПротоколИнтернетПочты.IMAP;
	КонецЕсли;
	ИнтернетПочта.Подключиться(ИнтернетПочтовыйПрофиль, Протокол);
	// } RGS EParshina 27.09.2018 18:47:10 - S-I-0006076
	
	
	ОписаниеОшибки = Неопределено;
	Попытка
		UnprocessedEmails = ImportExportСервер.ПолучитьUnprocessedEmails(ИнтернетПочта, ИнтернетПочтовыйПрофиль.ПользовательIMAP);
	Исключение
		ОписаниеОшибки = "Failed to get unprocessed emails:
			|" + ОписаниеОшибки();
	КонецПопытки;
	
	ИнтернетПочта.Отключиться();
	
	Если ОписаниеОшибки <> Неопределено Тогда
		ВызватьИсключение ОписаниеОшибки;	
	КонецЕсли;
            	
	FillUnprocessed(UnprocessedEmails);
	
КонецПроцедуры

&НаСервере
Процедура FillUnprocessed(UnprocessedEmails)
	
	Объект.Unprocessed.Очистить();
	Для Каждого Письмо Из UnprocessedEmails Цикл
		
		Если Не Обработки.PullReportsFromServiceProvidersEmails.ТемаПисьмаLeg7Report(Письмо.Тема) Тогда 
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.Unprocessed.Добавить();
		
		НоваяСтрока.UID = Письмо.Идентификатор[0];
		
		НоваяСтрока.SentDate = Письмо.ДатаОтправления;
		
		НоваяСтрока.From = Письмо.Отправитель.Адрес;
		
		НоваяСтрока.Subject = Письмо.Тема;
		
		НоваяСтрока.Body = ImportExportСервер.ПолучитьПростойТекстПисьма(Письмо);
		 		
		НоваяСтрока.Attachment = Обработки.PullReportsFromServiceProvidersEmails.ПолучитьПутьКXMLФайлу(Письмо.Вложения);
		Если НоваяСтрока.Attachment = "The attached file is not .zip." И Не РГСофтСерверПовтИспСеанс.ЭтоProductionБаза() Тогда
			НоваяСтрока.Attachment = Обработки.PullReportsFromServiceProvidersEmails.ПолучитьПутьКXMLФайлу(Письмо.Вложения, Ложь);
		КонецЕсли;
		
	КонецЦикла;	
		
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////
// LOAD

&НаКлиенте
Процедура Load(Команда)
	
	ИДВыделенныхСтрок = Элементы.Unprocessed.ВыделенныеСтроки;
	Если НЕ ИДВыделенныхСтрок.Количество() Тогда
		Сообщить("Select at least one not processed e-mail!");
		Возврат;
	КонецЕсли;
	
	МассивUIDs = Новый Массив;
	Для Каждого ИДВыделеннойСтроки Из ИДВыделенныхСтрок Цикл
		
		СтрокаТЧ = Объект.Unprocessed.НайтиПоИдентификатору(ИДВыделеннойСтроки);
		МассивUIDs.Добавить(СтрокаТЧ.UID);
		
	КонецЦикла;

	ЗагрузитьНаСервере(МассивUIDs);
			
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(МассивUIDs)
	
	УстановитьПривилегированныйРежим(Истина);
	// { RGS EParshina 27.09.2018 18:47:10 - S-I-0006076
	//ИнтернетПочтовыйПрофиль = ImportExportСерверПовтИспСеанс.ПолучитьИнтернетПочтовыйПрофиль();
	//ИнтернетПочта = ImportExportСервер.ПодключитьсяКИнтернетПочте(ИнтернетПочтовыйПрофиль);
	УчетнаяЗапись = Константы.RIETEmailAccount.Получить();
	ИнтернетПочтовыйПрофиль = РаботаСПочтовымиСообщениямиСлужебный.ИнтернетПочтовыйПрофиль(УчетнаяЗапись, Истина);
	
	ИнтернетПочта = Новый ИнтернетПочта;
	Протокол = ПротоколИнтернетПочты.POP3;
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись, "ПротоколВходящейПочты") = "IMAP" Тогда
		Протокол = ПротоколИнтернетПочты.IMAP;
	КонецЕсли;
	ИнтернетПочта.Подключиться(ИнтернетПочтовыйПрофиль, Протокол);
	// } RGS EParshina 27.09.2018 18:47:10 - S-I-0006076
		
	// { RGS VChaplygin 15.04.2016 8:42:22 - Добавим аварийный почтовый аккаунт
	ИспользоватьСистемнуюУчетнуюЗапись = Истина;
	ИнтернетПочтовыйПрофильRCA = ImportExportСерверПовтИспСеанс.ПолучитьИнтернетПочтовыйПрофиль(ИспользоватьСистемнуюУчетнуюЗапись);
 	ИнтернетПочтаRCA = ImportExportСервер.ПодключитьсяКИнтернетПочте(ИнтернетПочтовыйПрофильRCA);
	
	ДанныеДляОтправкиОтвета = Новый Структура;
	ДанныеДляОтправкиОтвета.Вставить("ИнтернетПочта", ИнтернетПочта);
	ДанныеДляОтправкиОтвета.Вставить("ИнтернетПочтаRCA", ИнтернетПочтаRCA);
	ДанныеДляОтправкиОтвета.Вставить("АдресОтправителя", ИнтернетПочтовыйПрофиль.ПользовательSMTP); 
	//ДанныеДляОтправкиОтвета.Вставить("АдресПолучателя", "");
	//ДанныеДляОтправкиОтвета.Вставить("ТемаИсходногоПисьма", "");
	// } RGS VChaplygin 15.04.2016 8:42:40 - Добавим аварийный почтовый аккаунт
	
	ОписаниеОшибки = Неопределено;
	Попытка
		Письма = ИнтернетПочта.Выбрать(Ложь, МассивUIDs);
		// { RGS VChaplygin 15.04.2016 8:42:22 - Добавим аварийный почтовый аккаунт
		//Обработки.PullReportsFromServiceProvidersEmails.ОбработатьПисьма(Письма, ИнтернетПочта, ИнтернетПочтовыйПрофиль.ПользовательSMTP);
		ОбработанныеПисьма = Обработки.PullReportsFromServiceProvidersEmails.ОбработатьПисьма(Письма, ДанныеДляОтправкиОтвета);
		// } RGS VChaplygin 15.04.2016 8:42:40 - Добавим аварийный почтовый аккаунт
	Исключение
		ОписаниеОшибки = "Failed to load reports from selected e-mails:
			|" + ОписаниеОшибки();
	КонецПопытки;
	
	ИнтернетПочта.Отключиться();
	// { RGS VChaplygin 27.10.2016 8:42:22 - Добавим аварийный почтовый аккаунт
	ИнтернетПочтаRCA.Отключиться();
	// } RGS VChaplygin 27.10.2016 8:42:40 - Добавим аварийный почтовый аккаунт
	
	Если ОписаниеОшибки <> Неопределено Тогда
		ВызватьИсключение ОписаниеОшибки;	
	КонецЕсли;
	
	ReceiveEmailsНаСервере();
	Элементы.Processed.Обновить();
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////
// MARK AS PROCESSED

&НаКлиенте
Процедура MarkAsProcessed(Команда)
	
	ИДВыделенныхСтрок = Элементы.Unprocessed.ВыделенныеСтроки;
	Если НЕ ИДВыделенныхСтрок.Количество() Тогда
		Сообщить("Select at least one not processed e-mail!");
		Возврат;
	КонецЕсли;
	
	МассивUIDs = Новый Массив;
	Для Каждого ИДВыделеннойСтроки Из ИДВыделенныхСтрок Цикл
		
		СтрокаТЧ = Объект.Unprocessed.НайтиПоИдентификатору(ИДВыделеннойСтроки);
		МассивUIDs.Добавить(СтрокаТЧ.UID);
		
	КонецЦикла;
	
	MarkAsProcessedНаСервере(МассивUIDs);
	
КонецПроцедуры

&НаСервере
Процедура MarkAsProcessedНаСервере(МассивUIDs)
	
	ИнтернетПочтовыйПрофиль = ImportExportСерверПовтИспСеанс.ПолучитьИнтернетПочтовыйПрофиль();
	ИнтернетПочта = ImportExportСервер.ПодключитьсяКИнтернетПочте(ИнтернетПочтовыйПрофиль);
	
	РегистрыСведений.UIDsOfProcessedEmails.ДобавитьНесколько(МассивUIDs, ИнтернетПочтовыйПрофиль.ПользовательIMAP);
	ReceiveEmailsНаСервере();
	Элементы.Processed.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура LoadFile(Команда)
	
	СтруктураВозврата = ОткрытьФормуМодально("Обработка.PullReportsFromServiceProvidersEmails.Форма.ФормаУказанияФайла", Новый Структура("ИмяФайла", ИмяФайла), ЭтаФорма);
	Если СтруктураВозврата <> Неопределено Тогда
		ИмяФайла = СтруктураВозврата["ИмяФайла"];
		ServiceProvider = СтруктураВозврата["ServiceProvider"];
		LoadFileНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура LoadFileНаСервере()
	
	Обработки.PullReportsFromServiceProvidersEmails.ОбработатьФайл(ИмяФайла, ServiceProvider);
	
КонецПроцедуры
